org-init.org
#+TITLE: Org-mode config

Org-mode is one of the most popular emacs package that has multiple
unexpected integrations compared to its original use. For example,
this whole config is written in org-mode file.
This part of the config aims to improve everything that has a dependency with org.

*** Org-mode

Base package of org-mode

Github repository: https://github.com/bzg/org-mode (mirror only)
#+BEGIN_SRC emacs-lisp
  (use-package org
    :straight (org :type git :host github :repo "bzg/org-mode")
    :config
    (setq org-src-tab-acts-natively t)
    (global-set-key (kbd "C-c C-c") 'org-edit-special)

    )
    (setq org-html-validation-link nil)
#+END_SRC

*** Org-Appear
Hide noisy markers for editing options such as *=*, *** or /*/.
=org-hide-emphasis-markers= needs to be different from nil for this option to work
#+BEGIN_SRC emacs-lisp
    (use-package org-appear
      :hook (org-mode . org-appear-mode)
      :config
      (setq org-hide-emphasis-markers t)
    )
#+END_SRC
*** Org-Bullets

Nicer bullet points

Github repository: https://github.com/sabof/org-bullets

Snippet taken from https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :straight (org-bullets :type git :host github :repo "sabof/org-bullets")
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+END_SRC
<<<<<<< Updated upstream

*** TODO Org-babel
*** Org-tempo

Really cool package that lets you create templates for code blocks

#+BEGIN_SRC emacs-lisp
    (with-eval-after-load 'org
      ;; This is needed as of Org 9.2
      (require 'org-tempo)

      (add-to-list 'org-structure-template-alist '("csrc" . "src c"))
      (add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("http" . "src http"))
      (add-to-list 'org-structure-template-alist '("java" . "src java"))
      (add-to-list 'org-structure-template-alist '("json" . "src json"))
      (add-to-list 'org-structure-template-alist '("latex" . "src latex"))
      (add-to-list 'org-structure-template-alist '("py" . "src python"))
      (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
      (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))

  )
#+END_SRC
*** Org-appear

Hide noisy markers for editing options such as *=*, *** or /*/.
=org-hide-emphasis-markers= needs to be different from nil for this option to work
#+BEGIN_SRC emacs-lisp
      (use-package org-appear
      ;;  :straight (org-appear :type git :host github :repo "awth13/org-appear")
        :hook (org-mode . org-appear-mode)
        :config
        (setq org-hide-emphasis-markers t)
        )
#+END_SRC

*** Org-bars
Virtual indent lines to make it easier to see which block i'm currently editing
#+begin_src emacs-lisp
  (use-package org-bars
    :straight (org-bars :type git :host github :repo "tonyaldon/org-bars")
    :config
    (org-bars-mode)
    )
#+end_src

=======
*** Org-Journal
Org package to keep a diary of my work (and maybe more ?)

#+begin_src emacs-lisp
  (use-package org-journal
    :defer t
    :init
    (setq org-journal-prefix-key "C-c j")
    :config
    (setq org-journal-dir "~/org/journal"
          org-journal-date-format "(%A) %d/%m/%Y"))
#+end_src
>>>>>>> Stashed changes
*** Org-Roam
    #+begin_src emacs-lisp
           (use-package org-roam
             :ensure t
             :init
             (setq org-roam-v2-ack t)
          ;;   :hook
          ;;   (after-init . org-roam-mode)
            :config
            (org-roam-db-autosync-mode)
            (setq org-roam-completion-everywhere t
                  org-roam-completion-system 'default
                  org-roam-directory "~/Notes/")
             :bind (:map org-roam-mode-map
                        (("C-c n l"   . org-roam)
                         ("C-c n f"   . org-roam-find-file)
                         ("C-c n g"   . org-roam-graph))
                        :map org-mode-map
                        (("C-c n i" . org-roam-insert))
                        (("C-c n I" . org-roam-insert-immediate))))

          (use-package deft
            :commands (deft)
            :config
            (setq deft-directory "~/Notes/Roam"
                           deft-recursive t
                           deft-extensions '("md" "org"))
             )
    #+end_src


*** Org-tempo

Really cool package that lets you create templates for code blocks

#+BEGIN_SRC emacs-lisp
    (with-eval-after-load 'org
      ;; This is needed as of Org 9.2
      (require 'org-tempo)

      (add-to-list 'org-structure-template-alist '("csrc" . "src c"))
      (add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("http" . "src http"))
      (add-to-list 'org-structure-template-alist '("java" . "src java"))
      (add-to-list 'org-structure-template-alist '("json" . "src json"))
      (add-to-list 'org-structure-template-alist '("latex" . "src latex"))
      (add-to-list 'org-structure-template-alist '("py" . "src python"))
      (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
      (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))

  )
#+END_SRC
    
